Группа_1С/src/Catalogs/ИнформационныеБазы/ИнформационныеБазы.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>ИнформационныеБазы</name>
  <hierarchical>true</hierarchical>
  <attributes>
    <name>Адрес</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>ИмяФайла</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>SQL</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>Платформа</name>
    <type>
      <types>EnumRef.Платформы</types>
    </type>
  </attributes>
  <attributes>
    <name>Конфигурация</name>
    <type>
      <types>CatalogRef.Конфигурации</types>
    </type>
  </attributes>
  <attributes>
    <name>Архивная</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>Комментарий</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>200</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Сервер</name>
    <type>
      <types>CatalogRef.Серверы</types>
    </type>
  </attributes>
  <attributes>
    <name>Типовая</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>СерверБазДанных</name>
    <type>
      <types>CatalogRef.Серверы</types>
    </type>
  </attributes>
</mdclass:Catalog>

Группа_1С/src/Catalogs/ИнформационныеБазы/ManagerModule.bsl
// Функция - Получить данные для COMСоединения
//
// Параметры:
//  ИнформационнаяБаза	 - СправочникСсылка.ИнформационнаяБаза - информационная база, к которой производится подключение
// 
// Возвращаемое значение:
//  Структура - структура данных, необходимых для подключения к информационной базе
//
Функция ПолучитьДанныеДляCOMСоединения(ИнформационнаяБаза) Экспорт
	Структура = Новый Структура;
	Структура.Вставить("SQL");
	Структура.Вставить("ИмяСервера");
	Структура.Вставить("Порт");
	Структура.Вставить("ИмяБазы");
	Структура.Вставить("ВерсияПлатформы"	, ИнформационнаяБаза.Платформа);
	Структура.Вставить("Пользователь"		, Константы.АдминистраторИБЛогин.Получить());
	Структура.Вставить("Пароль"				, Константы.АдминистраторИБПароль.Получить());
	Структура.SQL = ИнформационнаяБаза.SQL;
	
	Если ИнформационнаяБаза.SQL Тогда
		Структура.ИмяСервера = ИнформационнаяБаза.Сервер;
		Структура.ИмяБазы = ИнформационнаяБаза.ИмяФайла;
		Структура.Порт = ИнформационнаяБаза.Сервер.Порт;
	Иначе
		Структура.ИмяСервера = ИнформационнаяБаза.Адрес;
		Структура.ИмяБазы = "";
	КонецЕсли;
	
	Возврат Структура;
КонецФункции
